app/controllers/add_species_controller.rb

INSERT INTO "species" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Capybara"], ["created_at", "2016-06-10 22:16:05.250279"], ["updated_at", "2016-06-10 22:16:05.250279"]]
---
  def Add
    species_name = params[:species_name]
    @species = Species.new
    @species.name = species_name
    @species.save